{
    "Tornado Watch": "Conditions favorable for the development of severe thunderstorms and tornadoes.",
    "Particularly Dangerous Situation Tornado Watch": "Conditions favorable for the possibility of severe thunderstorms to produce destructive tornadoes.",
    "Tornado Warning": "Strong rotation in a thunderstorm indicated by Doppler weather radar or a tornado sighting.",
    "Particularly Dangerous Situation Tornado Warning": "A large tornado has been confirmed to be producing damage and is moving in the warned area.",
    "Tornado Emergency": "A violent tornado is expected to impact a heavily populated area.",
    "Severe Thunderstorm Watch": "A chance of a thunderstorm containing damaging hail of 25+ mm diameter, and/or damaging 95+ km/h winds.",
    "Particularly Dangerous Situation Severe Thunderstorm Watch": "Conditions favorable for severe thunderstorms, possibly with 150+ hm/h winds.",
    "Severe Thunderstorm Warning": "A thunderstorm containing large damaging hail of 2.5+ cm in diameter, and/or damaging winds of 93 km/h or greater.",
    "Significant Weather Advisory": "A thunderstorm is indicated by Doppler weather radar, containing small hail below 2.5 cm diameter, and/or strong winds of 63–92 km/h.",
    "Flash Flood Watch": "A chance of flash flooding.",
    "Particularly Dangerous Situation Flash Flood Watch": "Conditions favorable for an elevated level of severe and life-threatening flash flooding beyond the level of a normal flash flood.",
    "Flash Flood Warning": "Flooding is occurring or imminent. A flash flood is a flood that occurs within six hours of heavy rainfall and threatens life and/or property.",
    "Flash Flood Emergency": "Widespread flooding is occuring, and either, multiple water rescues have been reported, or floods in highly populated regions is likely to cause loss of life and property.",
    
    "Blizzard Warning": "Snowfall reduces visibility to at most 0.4 km for 3+ hours and continuous or frequent 55+ km/h winds are occurring or expected within the next 12 to 18 hours.",
    "Ice Storm Warning": "6+ mm of ice accumulation.",
    "Winter Storm Watch": "A chance for hazardous winter weather within 48 hours. Hazardous winter weather is not guaranteed to occur.",
    "Winter Storm Warning": "Hazardous winter weather is occurring or imminent.\nConditions include two or more of these conditions: heavy snow, freezing rain, sleet, and/or strong winds",
    "Winter Weather Advisory": "Hazardous winter conditions are occurring or imminent. Conditions will cause inconvenience, and without caution, could threaten life and/or property.",
    
    "Fire Warning": "A fire is currently burning in the area and evacuation is recommended.",
    "Red Flag Warning": "Conditions favorable for the rapid spread of wildfires",
    "Fire Weather Watch": "Conditions expected to become favorable for the rapid spread of wildfires.",
    
    "River Flood Warning": "Flooding of streams or rivers is occurring, imminent, or highly likely.",
    "Areal Flood Warning": "General or areal flooding of streets, low-lying areas, urban storm drains, creeks, and small streams is occurring, imminent, or highly likely.",
    "River Flood Advisory ": "Streams or rivers reaching action stage is occurring, imminent, or highly likely. During action stage the water surface is near the top of a river's banks.",
    "Areal Flood Advisory": "Minor general or areal flooding of streets, low-lying areas, urban storm drains, creeks, and small streams is occurring, imminent, or highly likely.",
    "Urban and Small Stream Flood Advisory": "Ponding of water on streets, low-lying areas, highways, underpasses, storm drains, and elevation of creek and small stream levels is occurring or imminent.",
    
    "Excessive Heat Warning": "The heat index is expected to be around 43+ °C for two days, or the heat index will be around 41+ °C for 4+ consecutive days.",
    "Freeze Watch": "A chance of widespread freezing temperatures in the next 12-48 hours. Usually issued at the beginning and end of growing seasons.",
    "Freeze Warning": "Widespread freezing temperatures are expected in the next 12 to 24 hours. Usually issued at the beginning and end of growing seasons.",
    "Frost Advisory": "The minimum temperature is expected to be 0.6-2.2 °C on clear and calm nights. Usually issued during the growing season.",
    "Hard Freeze Warning": "Widespread temperatures at or below −2 °C during the growing season.",
    "Heat Advisory": "The heat index is expected to be around 41°C. Or the heat index will range from 38-40 °C for at least 4 consecutive days.",
    "Wind Chill Advisory": "Dangerous wind chills of -26 to -31 °C are imminent or occurring.",
    "Wind Chill Watch": "A chance of life-threatening wind chills of -32°C or lower.",
    "Wind Chill Warning": "Life-threatening wind chills of -32°C or lower are imminent or occurring.",
    
    "Air Stagnation Advisory": "Atmospheric conditions stable enough to cause air pollutants to accumulate.",
    "Ashfall Advisory": "An airborne ash plume resulting in ongoing deposition at the surface.",
    "Blowing Dust Advisory": "Widespread or localized blowing dust reducing visibilities to 1.6 km or less, but greater than 0.4 km.",
    "Dense Fog Advisory": "Widespread fog is expected to reduce visibilities to 0.4 km or less over a large area for at least 2 hours.",
    "Dense Smoke Advisory": "Widespread or localized smoke reducing visibilities to 0.4 km or less.",
    "Dust Storm Warning": "Widespread or localized blowing dust reducing visibilities 0.4 km or less.",
    "Special Weather Statement": "An advisory issued when a hazard is approaching advisory level.",
    "Civil Emergency Message": "A message to warn the public of an in-progress or imminent significant threat(s) to public safety and/or property.",
    
    "Wind Advisory": "Sustained wind speeds of 48 to 63 km/h lasting for at least an hour.",
    "High Wind Watch": "A chance for sustained 64+ km/h winds for over an hour or 58+ mph wind gusts for any duration.",
    "High Wind Warning": "The expectation of sustained 64+ km/h winds for over an hour or 58+ mph wind gusts for any duration.",
    "Hurricane Watch": "A chance of a tropical cyclone containing 74+ mph winds within 48 hours. These winds may be accompanied by a storm surge and/or flooding.",
    "Hurricane Warning": "Sustained 119+ km/h winds associated with a tropical cyclone are expected in 36 hours or less."
}